/**
 * Widget for topology chart
 */
(function () {
    'use strict';

    angular.module('oplus.udp').run(['echartsWidgetBuilder', 'widgetFactory', 'chartUpdater', 'widgetUiHelper', 'widgetDataUtil', 'themeService', '$timeout',
        function (chartWidgetBuilder, widgetFactory, chartUpdater, widgetUiHelper, widgetDataUtil, themeService, $timeout) {
            widgetFactory.defineWidget({
                type: 'topology-chart',
                name: '拓扑图（静态）',
                group: 'data',
                resizable: 'h',
                configController: function (scope) {
                    scope.selectGraphNode = function (node) {
                        scope.currentNode = node;
                        if (!node.itemStyle) {
                            node.itemStyle = {normal: {color: scope.uwProps.graph.common.node.color}};
                        }
                        if (!node.label) {
                            node.label = {
                                fontSize: scope.uwProps.graph.common.node.fontSize,
                                color: scope.uwProps.graph.common.node.fontColor
                            }
                        }
                        if (node.target && (!node.links || node.links.length === 0)) {
                            node.links = [];
                            var links = node.target.split(",");
                            if (scope.uwProps.graph.tableData) {
                                _.forEach(scope.uwProps.graph.tableData, function (tr) {
                                    _.forEach(tr,function(td){
                                        if (links.indexOf(td.id) !== -1) {
                                            node.links.push({
                                                name:td.name,
                                                target:td.id,
                                                lineStyle:{
                                                    normal:{
                                                        width:scope.uwProps.graph.common.line.width,
                                                        color:scope.uwProps.graph.common.line.color
                                                    }
                                                }
                                            });
                                        }
                                    })
                                });
                            }

                        }
                    }
                    scope.selectGraphLine = function(line) {
                        scope.currentLine = line;
                    }
                    if (!scope.uwProps.graph) {
                        scope.uwProps.graph = scope.uwProps.graph || {
                            common: {
                                node: {size: 40, color: 'rgb(0, 0, 0)', fontSize: 12, fontColor: 'rgb(0, 0, 0)'},
                                line: {width: 1, color: 'rgb(0, 0, 0)'}
                            }
                        };
                    }
                    chartUpdater.upgradeProps(scope.uwProps);
                    scope.uwProps.display = scope.uwProps.display || {};
                },
                controlRenderer: {
                    getTemplateForCompilation: getTemplateForCompilation,
                    onInitControl: onInitControl
                }
            });


            function getTemplateForCompilation(props) {
                if (!widgetDataUtil.isDatasetConfigGood(props.dataset)) {
                    throw new WidgetNotConfiguredError('数据源或数据字段没有设置好');
                }

                var display = props.display || {};
                var height = display.height ? '100%' : '800px';
                return '<div class="js-chart-obj" style="width: 100%;height:' + height + ';"></div>';
            }


            function onInitControl(scope, elem, props) {

                widgetDataUtil.queryData(elem, props).then(function (data) {
                    if (data.total > 0) {
                        var links = [];
                        _.forEach(data.records, function (obj) {
                            if (obj.target) {
                                _.forEach(obj.target.split(","), function (t) {
                                    links.push({"source": obj.id, "target": t});
                                })
                            }
                            obj.symbol = getDefaultSvgPah();
                            obj.symbolSize = props.graph.common.node.size || 40;

                        });
                        if (props.graph.tableData) {
                            _.forEach(props.graph.tableData, function (tr) {
                                _.forEach(tr,function(td){
                                    var obj = _.find(data.records,{id:td.id})
                                    _.merge(obj,td);
                                    _.forEach(td.links,function(link){
                                        var lineConfig = _.find(links,{target:link.target});
                                        _.merge(lineConfig,link);
                                    })
                                })
                            });
                        }
                        var option = getDefaultChartOption();
                        option.series[0].label.normal.textStyle.fontSize = props.graph.common.node.fontSize || 12;
                        option.series[0].label.normal.textStyle.color = props.graph.common.node.fontColor || 'rgb(0, 0, 0)';
                        option.series[0].itemStyle.normal.color = props.graph.common.node.color || 'rgb(0, 0, 0)';
                        option.series[0].lineStyle.normal.width = props.graph.common.line.width || 'rgb(0, 0, 0)';
                        option.series[0].lineStyle.normal.color = props.graph.common.line.color || 'rgb(0, 0, 0)';

                        option.series[0].data = data.records;
                        option.series[0].links = links;
                        var chartWrapper = elem.find('div.js-chart-obj');
                        // 使用刚指定的配置项和数据显示图表。
                        var chartObj = echarts.init(chartWrapper[0]);
                        chartObj.setOption(option);
                        if (!props.graph.tableData) {
                            props.graph.tableData = _.chunk(data.records, 3);

                            // 更新配置页面的值
                            widgetUiHelper.upgradeWidgetProps(elem, props);
                        }

                    }
                });
            }

            function getDefaultChartOption() {
                var option = {
                    //backgroundColor: '#000F1F',
                    tooltip: { //弹窗
                        /*trigger: 'item',*/
                        show: false
                    },
                    color: ['#09022C',
                        '#040193',
                        '#073CFE',
                        '#0065C2'
                    ],
                    legend: { //=========小图标，圖表控件
                        show: false,
                        data: [{
                            name: '一级分类',
                            symbol: 'diamond',
                            label: { //标签样式
                            }
                        }, {
                            name: '二级分类',
                            symbol: 'rect'
                        }, {
                            name: '三级分类',
                            symbol: 'roundRect'
                        }
                        ]
                    },
                    series: [{ //图片配置
                        type: 'graph', //关系图
                        //name : "拓扑图", //系列名称，用于tooltip的显示，legend 的图例筛选，在 setOption 更新数据和配置项时用于指定对应的系列。
                        layout: 'force', //图的布局，类型为力导图，'circular' 采用环形布局，见示例 Les Miserables
                        legendHoverLink: true, //是否启用图例 hover(悬停) 时的联动高亮。
                        hoverAnimation: true, //是否开启鼠标悬停节点的显示动画
                        coordinateSystem: null, //坐标系可选
                        xAxisIndex: 0, //x轴坐标 有多种坐标系轴坐标选项
                        yAxisIndex: 0, //y轴坐标
                        force: {
                            repulsion: 750, //相距距离
                            edgeLength: [20, 200],
                            layoutAnimation: true
                        },
                        /*force : { //力引导图基本配置
                            //initLayout: ,//力引导的初始化布局，默认使用xy轴的标点
                            repulsion : 200,//节点之间的斥力因子。支持数组表达斥力范围，值越大斥力越大。
                            gravity : 0.03,//节点受到的向中心的引力因子。该值越大节点越往中心点靠拢。
                            edgeLength :80,//边的两个节点之间的距离，这个距离也会受 repulsion。[10, 50] 。值越小则长度越长
                            layoutAnimation : true
                            //因为力引导布局会在多次迭代后才会稳定，这个参数决定是否显示布局的迭代动画，在浏览器端节点数据较多（>100）的时候不建议关闭，布局过程会造成浏览器假死。
                        },*/
                        roam: true, //是否开启鼠标缩放和平移漫游。默认不开启。如果只想要开启缩放或者平移，可以设置成 'scale' 或者 'move'。设置成 true 为都开启
                        nodeScaleRatio: 0.6, //鼠标漫游缩放时节点的相应缩放比例，当设为0时节点不随着鼠标的缩放而缩放
                        draggable: true, //节点是否可拖拽，只在使用力引导布局的时候有用。
                        focusNodeAdjacency: true, //是否在鼠标移到节点上的时候突出显示节点以及节点的边和邻接节点。
                        //symbol:'roundRect',//关系图节点标记的图形。ECharts 提供的标记类型包括 'circle'(圆形), 'rect'（矩形）, 'roundRect'（圆角矩形）, 'triangle'（三角形）, 'diamond'（菱形）, 'pin'（大头针）, 'arrow'（箭头）  也可以通过 'image://url' 设置为图片，其中 url 为图片的链接。'path:// 这种方式可以任意改变颜色并且抗锯齿
                        //symbolSize:10 ,//也可以用数组分开表示宽和高，例如 [20, 10] 如果需要每个数据的图形大小不一样，可以设置为如下格式的回调函数：(value: Array|number, params: Object) => number|Array
                        //symbolRotate:,//关系图节点标记的旋转角度。注意在 markLine 中当 symbol 为 'arrow' 时会忽略 symbolRotate 强制设置为切线的角度。
                        //symbolOffset:[0,0],//关系图节点标记相对于原本位置的偏移。[0, '50%']
                        edgeSymbol: ['none', 'arrow'], //边两端的标记类型，可以是一个数组分别指定两端，也可以是单个统一指定。默认不显示标记，常见的可以设置为箭头，如下：edgeSymbol: ['circle', 'arrow']
                        symbolSize: 50, //图形大小
                        edgeSymbolSize: 10, //边两端的标记大小，可以是一个数组分别指定两端，也可以是单个统一指定。
                        itemStyle: { //===============图形样式，有 normal 和 emphasis 两个状态。normal 是图形在默认状态下的样式；emphasis 是图形在高亮状态下的样式，比如在鼠标悬浮或者图例联动高亮时。
                            normal: { //默认样式
                                label: {
                                    show: true
                                },
                                //borderType : 'solid', //图形描边类型，默认为实线，支持 'solid'（实线）, 'dashed'(虚线), 'dotted'（点线）。
                                //borderColor : 'rgba(255,215,0,0.4)', //设置图形边框为淡金色,透明度为0.4
                                //borderWidth : 2, //图形的描边线宽。为 0 时无描边。
                                // opacity : 1 // 图形透明度。支持从 0 到 1 的数字，为 0 时不绘制该图形。默认0.5

                            },
                            emphasis: { //高亮状态

                            }
                        },
                        lineStyle: { //==========关系边的公用线条样式。
                            normal: {
                                color: '#31354B',
                                width: '1',
                                type: 'solid', //线的类型 'solid'（实线）'dashed'（虚线）'dotted'（点线）
                                curveness: 0, //线条的曲线程度，从0到1
                                opacity: 1
                                // 图形透明度。支持从 0 到 1 的数字，为 0 时不绘制该图形。默认0.5
                            },
                            emphasis: { //高亮状态

                            }
                        },
                        label: { //=============图形上的文本标签
                            normal: {
                                show: true, //是否显示标签。
                                position: 'bottom', //标签的位置。['50%', '50%'] [x,y]   'inside'
                                textStyle: { //标签的字体样式
                                    color: '#2D2F3B', //字体颜色
                                    fontStyle: 'normal', //文字字体的风格 'normal'标准 'italic'斜体 'oblique' 倾斜
                                    fontWeight: 'bolder', //'normal'标准'bold'粗的'bolder'更粗的'lighter'更细的或100 | 200 | 300 | 400...
                                    fontFamily: 'sans-serif', //文字的字体系列
                                    fontSize: 12, //字体大小
                                }
                            },
                            emphasis: { //高亮状态

                            }
                        },
                        edgeLabel: { //==============线条的边缘标签
                            normal: {
                                show: false
                            },
                            emphasis: { //高亮状态

                            }
                        },
                        //别名为nodes   name:影响图形标签显示,value:影响选中后值得显示,category:所在类目的index,symbol:类目节点标记图形,symbolSize:10图形大小
                        //label:标签样式。
                        //数据
                        data: [],
                        links: []
                        // categories: [ //symbol name：用于和 legend 对应以及格式化 tooltip 的内容。 label有效
                        //     {
                        //         name: '一级分类',
                        //         symbol: 'diamond',
                        //         label: { //标签样式
                        //         }
                        //     }, {
                        //         name: '二级分类',
                        //         symbol: 'rect'
                        //     }, {
                        //         name: '三级分类',
                        //         symbol: 'roundRect'
                        //     }
                        // ]
                    }]
                };
                return option;
            }

            function getSimpleData()  {

                var svg = {
                    server: "path://M960 42.666667H64c-12.8 0-21.333333 8.533333-21.333333 21.333333v896c0 12.8 8.533333 21.333333 21.333333 21.333333h896c12.8 0 21.333333-8.533333 21.333333-21.333333V64c0-12.8-8.533333-21.333333-21.333333-21.333333z m-21.333333 896H85.333333V682.666667h853.333334v256z m0-298.666667H85.333333V384h853.333334v256z m0-298.666667H85.333333V85.333333h853.333334v256zM298.666667 768h-42.666667v85.333333h42.666667v-85.333333z m-85.333334 0H170.666667v85.333333h42.666666v-85.333333z m661.333334 21.333333h-170.666667v42.666667h170.666667v-42.666667zM298.666667 469.333333h-42.666667v85.333334h42.666667v-85.333334z m-85.333334 0H170.666667v85.333334h42.666666v-85.333334z m661.333334 21.333334h-170.666667v42.666666h170.666667v-42.666666zM298.666667 170.666667h-42.666667v85.333333h42.666667V170.666667z m-85.333334 0H170.666667v85.333333h42.666666V170.666667z m661.333334 21.333333h-170.666667v42.666667h170.666667V192z",
                    db: "path://M1001.632 793.792c-7.84-13.856-26.016-37.536-93.12-83.2a1096.224 1096.224 0 0 0-125.152-74.144c-30.592-82.784-89.824-190.112-176.256-319.36-93.056-139.168-201.12-197.792-321.888-174.56a756.608 756.608 0 0 0-40.928-37.696C213.824 78.688 139.2 56.48 96.32 60.736c-19.424 1.952-34.016 9.056-43.36 21.088-21.664 27.904-14.432 68.064 85.504 198.912 19.008 55.616 23.072 84.672 23.072 99.296 0 30.912 15.968 66.368 49.984 110.752l-32 109.504c-28.544 97.792 23.328 224.288 71.616 268.384 25.76 23.552 47.456 20.032 58.176 15.84 21.504-8.448 38.848-29.472 50.048-89.504a4390.107 4390.107 0 0 1 18.208 45.6c34.56 87.744 68.352 136.288 106.336 152.736a32.032 32.032 0 0 0 25.44-58.688c-9.408-4.096-35.328-23.712-72.288-117.504-31.168-79.136-53.856-132.064-69.376-161.856a32.224 32.224 0 0 0-35.328-16.48 32.032 32.032 0 0 0-25.024 29.92c-3.872 91.04-13.056 130.4-19.2 147.008C261.632 785.28 220 689.76 240.896 618.208c20.768-71.232 32.992-112.928 36.64-125.248a31.936 31.936 0 0 0-5.888-29.28c-41.664-51.168-46.176-75.584-46.176-83.712 0-29.472-9.248-70.4-28.288-125.152a31.104 31.104 0 0 0-4.768-8.896c-53.824-70.112-73.6-105.216-80.832-121.888 25.632 1.216 74.336 15.04 91.008 29.376a660.8 660.8 0 0 1 49.024 46.304 31.902 31.902 0 0 0 31.232 8.928c100.192-25.92 188.928 21.152 271.072 144 87.808 131.328 146.144 238.048 173.408 317.216a32 32 0 0 0 16.384 18.432 1004.544 1004.544 0 0 1 128.8 75.264 944.85 944.85 0 0 1 20.064 14.016h-98.848a32.032 32.032 0 0 0-24.352 52.736 3098.752 3098.752 0 0 0 97.856 110.464 32 32 0 1 0 46.56-43.872 2237.6 2237.6 0 0 1-50.08-55.328h110.08a32.032 32.032 0 0 0 27.84-47.776zM320 289.472c12.672 21.76 22.464 37.344 29.344 46.784 8.288 16.256 21.184 29.248 29.44 45.536l2.016-1.984c14.528-9.952 25.92-49.504 2.752-75.488-12.032-18.176-51.04-17.664-63.552-14.848z",
                    app: "path://M512 0l448 256v512l-448 256-448-256V256l448-256z m0 98.24l-362.88 207.36v412.8L512 925.76l362.88-207.36v-412.8L512 98.24z m224 200.448l64.64 37.312v74.688L736 448l-30.784-17.792-155.968 78.08v185.216l27.392 15.808v74.688L512 821.312l-64.64-37.312v-74.688l27.392-15.808V508.352L318.72 430.208 288 448l-64.64-37.312V336l64.64-37.312 64.64 37.312v27.712L512 443.52l159.36-79.872V336l64.64-37.312z",
                    dbInstance: "path://M522.667 96l8.533 0.043a910.08 910.08 0 0 1 91.563 5.333l14.549 1.707 15.403 2.133 15.125 2.41 7.573 1.323 14.891 2.838c125.205 25.322 212.928 79.488 216.256 150.677l0.107 4.203v448c0 73.258-88.704 129.066-216.363 154.88l-14.89 2.837-7.574 1.323-15.125 2.389-15.403 2.133c-36.267 4.651-74.773 7.104-114.645 7.104s-78.379-2.453-114.646-7.104l-15.402-2.133-15.126-2.39c-137.088-23.189-235.264-79.487-238.72-154.9l-0.106-4.14v-448l0.106-4.202c3.328-71.19 91.051-125.355 216.256-150.677l14.891-2.838 7.573-1.322 15.126-2.39 15.402-2.133a892.203 892.203 0 0 1 97.643-6.955L522.667 96zM667.84 639.04l-15.125 2.39-15.403 2.133c-36.267 4.65-74.773 7.104-114.645 7.104s-78.379-2.454-114.646-7.104l-15.402-2.134-15.126-2.389c-71.488-12.096-132.416-33.195-174.826-61.312v136.939c0 20.949 24.17 42.773 65.066 61.184l9.75 4.181c15.04 6.187 32 11.925 50.602 17.024l12.651 3.307a642.594 642.594 0 0 0 40.597 8.704l14.379 2.453 14.741 2.197a765.06 765.06 0 0 0 30.571 3.627l15.765 1.408 16.064 1.11 16.363 0.81a845.995 845.995 0 0 0 66.901 0l16.363-0.81 16.064-1.11 15.787-1.408a768.635 768.635 0 0 0 30.549-3.627l14.741-2.197L664 809.067c14.165-2.56 27.733-5.483 40.597-8.704l12.651-3.307c18.603-5.12 35.563-10.837 50.603-17.024l9.749-4.181c39.317-17.707 63.19-38.55 64.96-58.774l0.107-2.41v-136.96c-42.39 28.138-103.318 49.237-174.827 61.333z m174.827-274.667c-40.299 26.731-97.28 47.104-164.203 59.456l-10.667 1.878-15.104 2.389-15.402 2.133c-36.267 4.651-74.774 7.104-114.646 7.104-34.176 0-67.349-1.792-98.986-5.248L408 430.23l-15.403-2.133-15.125-2.39c-71.488-12.095-132.416-33.194-174.827-61.311V480c0 20.95 24.171 42.773 65.067 61.184l9.75 4.181c15.04 6.187 32 11.926 50.602 17.024l12.65 3.307a642.594 642.594 0 0 0 40.598 8.704l14.379 2.453 14.741 2.198a765.059 765.059 0 0 0 30.57 3.626l15.766 1.408 16.064 1.11 16.363 0.81a845.995 845.995 0 0 0 66.901 0l16.363-0.81 16.064-1.11 15.786-1.408a768.637 768.637 0 0 0 30.55-3.626l14.741-2.198 14.379-2.453c14.165-2.56 27.733-5.483 40.597-8.704l12.65-3.307c18.603-5.12 35.563-10.837 50.603-17.024l9.75-4.181c39.317-17.707 63.189-38.55 64.96-58.773l0.106-2.411V364.373zM522.667 160l-8.448 0.043-12.587 0.213-12.416 0.405-16.363 0.811-16.064 1.11-15.786 1.407c-6.934 0.683-13.76 1.451-20.502 2.304l-10.026 1.323-14.763 2.197-14.379 2.454a664.253 664.253 0 0 0-30.826 6.336l-9.771 2.346-12.65 3.328c-15.489 4.267-29.867 8.96-42.923 13.974l-7.68 3.05-9.75 4.182c-40.896 18.41-65.066 40.234-65.066 61.184 0 20.053 22.122 40.874 59.84 58.773l5.226 2.41 9.75 4.182c12.522 5.163 26.389 10.005 41.45 14.421l9.174 2.603 12.629 3.307c9.643 2.41 19.69 4.65 30.08 6.72l10.517 1.984 14.379 2.453 14.741 2.197c6.635 0.939 13.376 1.771 20.224 2.56l10.347 1.067 15.765 1.408 16.064 1.11 16.363 0.81a845.995 845.995 0 0 0 55.872 0.363l11.03-0.363 16.362-0.81 16.064-1.11 15.787-1.408c6.933-0.683 13.76-1.45 20.501-2.304l10.027-1.323 14.762-2.197L664 361.067a664.253 664.253 0 0 0 30.827-6.336l9.77-2.347 12.651-3.328c15.488-4.267 29.867-8.96 42.923-13.973l7.68-3.051 9.749-4.181c40.896-18.411 65.067-40.235 65.067-61.184 0-20.054-22.123-40.875-59.84-58.774l-5.227-2.41-9.75-4.182a424.47 424.47 0 0 0-41.45-14.421l-9.173-2.603-12.63-3.306a623.659 623.659 0 0 0-30.08-6.72L664 172.267l-14.379-2.454-14.741-2.197a765.995 765.995 0 0 0-20.224-2.56l-10.347-1.067-15.765-1.408-16.064-1.109-16.363-0.81c-7.317-0.3-14.72-0.491-22.186-0.598L522.667 160z",
                    service: "path://M1064.61271 553.895788a25.257446 25.257446 0 0 0-16.038478-15.217611L786.780805 458.170068V125.150644a23.23685 23.23685 0 0 0-8.776962-18.943084 25.257446 25.257446 0 0 0-16.038478-15.217611L468.221269 1.326016a29.046063 29.046063 0 0 0-18.437935 0.820867L232.948161 101.156071a26.646605 26.646605 0 0 0-15.217612 24.81544v325.757909a10.166122 10.166122 0 0 0 0.820867 4.798914L15.228977 549.349448A26.646605 26.646605 0 0 0 0.011366 574.164889v324.937041a25.699451 25.699451 0 0 0 18.437935 24.815441l310.540298 91.242523a22.163409 22.163409 0 0 0 7.198372 0.820867h0.820867a12.123574 12.123574 0 0 0 15.217611 7.198372l193.72461-92.821114 287.36659 84.865019a22.163409 22.163409 0 0 0 7.198372 0.820867h0.820867a12.123574 12.123574 0 0 0 15.217612 7.198372l208.373928-99.261763a16.796202 16.796202 0 0 0 8.776963-13.575877V573.407165a20.458531 20.458531 0 0 0-9.092681-19.511377zM462.727775 52.030339l220.11864 68.005673-145.672319 66.427082-97.683172-28.47777-124.834926-38.391318z m-194.482334 108.859591l156.091016 45.652834 103.23981 32.013812V508.306099l-259.330826-75.772338z m42.432509 795.609546l-259.330825-75.772338v-271.517543l156.091015 45.652833 103.23981 32.013813v269.749522z m8.776963-322.032435l-97.620029-28.793489-124.834926-38.391317 148.071777-67.24795L464.74837 568.608251z m495.424801 322.032435l-245.691805-72.046865v-271.517543l141.820559 41.990504 103.23981 32.013813v269.749522z m8.776962-322.032435l-97.620028-28.793489-124.89807-37.886168 147.756058-67.24795 220.118641 68.005673z",
                    module: "path://M673.8 903.8H532.2c-13.8 0-25-11.2-25-25v-41.5c0-15.2-5.9-29.5-16.7-40.3-10.8-10.8-25.1-16.7-40.3-16.7-31.4 0-57 25.6-57 57v41.5c0 13.8-11.2 25-25 25H226.8c-59 0-107-48-107-107V655.2c0-13.8 11.2-25 25-25h41.5c15.2 0 29.5-5.9 40.3-16.7 10.8-10.8 16.7-25.1 16.7-40.3 0-31.4-25.6-57-57-57h-41.5c-13.8 0-25-11.2-25-25V349.8c0-59 48-107 107-107h116.5v-15.5c0-59 48-107 107-107 28.6 0 55.4 11.1 75.7 31.3 20.2 20.2 31.3 47.1 31.3 75.7v15.5h116.5c59 0 107 48 107 107v116.5h16.5c59 0 107 48 107 107 0 28.6-11.1 55.4-31.3 75.7-20.2 20.2-47.1 31.3-75.7 31.3h-16.5v116.5c0 59-48 107-107 107z m-116.6-50h116.5c31.4 0 57-25.6 57-57V655.2c0-13.8 11.2-25 25-25h41.5c15.2 0 29.5-5.9 40.3-16.7 10.8-10.8 16.7-25.1 16.7-40.3 0-31.4-25.6-57-57-57h-41.5c-13.8 0-25-11.2-25-25V349.8c0-31.4-25.6-57-57-57H532.2c-13.8 0-25-11.2-25-25v-40.5c0-15.2-5.9-29.5-16.7-40.3-10.8-10.8-25.1-16.7-40.3-16.7-31.4 0-57 25.6-57 57v40.5c0 13.8-11.2 25-25 25H226.8c-31.4 0-57 25.6-57 57v116.5h16.5c59 0 107 48 107 107 0 28.6-11.1 55.4-31.3 75.7-20.2 20.2-47.1 31.3-75.7 31.3h-16.5v116.5c0 31.4 25.6 57 57 57h116.5v-16.5c0-59 48-107 107-107 28.6 0 55.4 11.1 75.7 31.3 20.2 20.2 31.3 47.1 31.3 75.7v16.5z"
                }
                var data = [
                    {id: 0, name: "Oplus-Server", target: "1,2"},
                    {id: 1, name: "Application", target: "6,7,8,9,10"},
                    {id: 2, name: "MySQL", target: "3,4"},
                    {id: 3, name: "oplus"},
                    {id: 4, name: "oplus-demo"},
                    {id: 5, name: "xxl-job"},
                    {id: 6, name: "svs", target: "11,12,13,14,15,16,17,18,19"},
                    {id: 7, name: "ata"},
                    {id: 8, name: "dts"},
                    {id: 9, name: "portal"},
                    {id: 10, name: "jobadm"},
                    {id: 11, name: "uim"},
                    {id: 12, name: "jao"},
                    {id: 13, name: "cac"},
                    {id: 14, name: "command"},
                    {id: 15, name: "acm"},
                    {id: 16, name: "vap"},
                    {id: 17, name: "adm"},
                    {id: 18, name: "mac"},
                    {id: 19, name: "udp"}
                ]

                var links = [
                    {source: 0, target: 1},
                    {source: 0, target: 2},
                    {source: 2, target: 3},
                    {source: 2, target: 4},
                    {source: 2, target: 5},
                    {source: 1, target: 6},
                    {source: 1, target: 7},
                    {source: 1, target: 8},
                    {source: 1, target: 9},
                    {source: 1, target: 10},
                    {source: 6, target: 11},
                    {source: 6, target: 12},
                    {source: 6, target: 13},
                    {source: 6, target: 14},
                    {source: 6, target: 15},
                    {source: 6, target: 16},
                    {source: 6, target: 17},
                    {source: 6, target: 18},
                    {source: 6, target: 19}
                ]

            }

            function getDefaultSvgPah() {
                return "path://M512 85.333333a426.666667 426.666667 0 1 0 426.666667 426.666667A426.666667 426.666667 0 0 0 512 85.333333z m0 682.666667a42.666667 42.666667 0 1 1 42.666667-42.666667 42.666667 42.666667 0 0 1-42.666667 42.666667z m42.666667-220.16V597.333333a42.666667 42.666667 0 0 1-85.333334 0v-85.333333a42.666667 42.666667 0 0 1 42.666667-42.666667 64 64 0 1 0-64-64 42.666667 42.666667 0 0 1-85.333333 0 149.333333 149.333333 0 1 1 192 142.506667z";
                // return "path://M512 901.746939c-13.583673 0-26.122449-4.179592-37.093878-13.061225-8.881633-7.314286-225.697959-175.020408-312.424489-311.379592C133.746939 532.37551 94.040816 471.24898 94.040816 384.522449c0-144.718367 108.146939-262.269388 240.326531-262.269388 67.395918 0 131.657143 30.82449 177.632653 84.636735 45.453061-54.334694 109.191837-84.636735 177.110204-84.636735 132.702041 0 240.326531 117.55102 240.326531 262.269388 0 85.159184-37.093878 143.673469-67.395919 191.216327l-1.044898 1.567346c-86.726531 136.359184-303.542857 304.587755-312.424489 311.379592-10.44898 8.359184-22.987755 13.061224-36.571429 13.061225z";
            }
        }]);
})();
